plotMachineIOPS_LATENCY/fio_output/read-1jobs-64files-32k.fio_fuse_boc.out
jobs1: (g=0): rw=read, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=1): err= 0: pid=479000: Tue Jul 25 22:19:49 2023
  read: IOPS=93.1k, BW=2909MiB/s (3050MB/s)(30.0GiB/10560msec)
    slat (usec): min=2, max=366, avg=10.23, stdev=15.05
    clat (nsec): min=1922, max=26572k, avg=1362165.09, stdev=952889.44
     lat (usec): min=6, max=26910, avg=1372.44, stdev=957.20
    clat percentiles (usec):
     |  1.00th=[  594],  5.00th=[  603], 10.00th=[  603], 20.00th=[  611],
     | 30.00th=[  619], 40.00th=[  734], 50.00th=[  947], 60.00th=[ 1287],
     | 70.00th=[ 1565], 80.00th=[ 2343], 90.00th=[ 2606], 95.00th=[ 3163],
     | 99.00th=[ 4555], 99.50th=[ 4817], 99.90th=[ 5211], 99.95th=[ 5473],
     | 99.99th=[11863]
   bw (  MiB/s): min= 1809, max= 3102, per=99.92%, avg=2906.85, stdev=399.89, samples=21
   iops        : min=57888, max=99294, avg=93019.14, stdev=12796.59, samples=21
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=43.22%, 1000=9.86%
  lat (msec)   : 2=22.50%, 4=22.44%, 10=1.96%, 20=0.01%, 50=0.01%
  cpu          : usr=3.78%, sys=96.06%, ctx=178, majf=0, minf=1038
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=983040,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2909MiB/s (3050MB/s), 2909MiB/s-2909MiB/s (3050MB/s-3050MB/s), io=30.0GiB (32.2GB), run=10560-10560msec