plotMachineIOPS_LATENCY/fio_output/read-32jobs-128files-512k.fio_ramdisk.out
jobs1: (g=0): rw=read, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO files (128 files / total 30720MiB)

jobs1: (groupid=0, jobs=32): err= 0: pid=869639: Wed Jul 26 04:11:05 2023
  read: IOPS=11.5k, BW=5767MiB/s (6047MB/s)(30.0GiB/5327msec)
    slat (usec): min=72, max=647, avg=85.88, stdev=17.47
    clat (nsec): min=1803, max=48996k, avg=10952514.30, stdev=1561788.40
     lat (usec): min=77, max=49644, avg=11038.45, stdev=1577.63
    clat percentiles (usec):
     |  1.00th=[10290],  5.00th=[10290], 10.00th=[10290], 20.00th=[10290],
     | 30.00th=[10290], 40.00th=[10290], 50.00th=[10290], 60.00th=[10290],
     | 70.00th=[10290], 80.00th=[13304], 90.00th=[13304], 95.00th=[13435],
     | 99.00th=[13435], 99.50th=[13435], 99.90th=[26346], 99.95th=[35390],
     | 99.99th=[45876]
   bw (  MiB/s): min= 4358, max= 6189, per=100.00%, avg=5769.89, stdev=698.94, samples=10
   iops        : min= 8717, max=12378, avg=11539.60, stdev=1398.02, samples=10
  lat (usec)   : 2=0.01%, 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.04%, 10=0.12%, 20=99.65%, 50=0.15%
  cpu          : usr=0.96%, sys=98.97%, ctx=6, majf=0, minf=16448
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=61440,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=5767MiB/s (6047MB/s), 5767MiB/s-5767MiB/s (6047MB/s-6047MB/s), io=30.0GiB (32.2GB), run=5327-5327msec