plotMachineIOPS_LATENCY/fio_output/read-32jobs-64files-4k.fio_tmpfs.out
jobs1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=32): err= 0: pid=461060: Tue Jul 25 21:29:02 2023
  read: IOPS=612k, BW=2392MiB/s (2508MB/s)(30.0GiB/12843msec)
    slat (nsec): min=792, max=41002, avg=1197.75, stdev=508.53
    clat (nsec): min=1384, max=1571.7k, avg=207596.77, stdev=39523.09
     lat (usec): min=3, max=1599, avg=208.83, stdev=39.76
    clat percentiles (usec):
     |  1.00th=[  192],  5.00th=[  194], 10.00th=[  194], 20.00th=[  194],
     | 30.00th=[  196], 40.00th=[  196], 50.00th=[  196], 60.00th=[  196],
     | 70.00th=[  198], 80.00th=[  198], 90.00th=[  204], 95.00th=[  334],
     | 99.00th=[  338], 99.50th=[  343], 99.90th=[  355], 99.95th=[  478],
     | 99.99th=[  701]
   bw (  MiB/s): min= 1465, max= 2541, per=100.00%, avg=2399.98, stdev=351.23, samples=25
   iops        : min=375292, max=650704, avg=614394.36, stdev=89914.82, samples=25
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=91.74%, 500=8.22%, 750=0.03%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=23.98%, sys=76.02%, ctx=21, majf=0, minf=201
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=7864320,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2392MiB/s (2508MB/s), 2392MiB/s-2392MiB/s (2508MB/s-2508MB/s), io=30.0GiB (32.2GB), run=12843-12843msec