plotMachineIOPS_LATENCY/fio_output/write-16jobs-512files-512k.fio_fuse_ext4.out
jobs1: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (512 files / total 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=1143949: Wed Jul 26 07:53:51 2023
  write: IOPS=3015, BW=1508MiB/s (1581MB/s)(30.0GiB/20374msec); 0 zone resets
    slat (usec): min=163, max=533225, avg=326.62, stdev=2301.24
    clat (nsec): min=1994, max=125196k, avg=40891465.69, stdev=16179096.11
     lat (usec): min=263, max=658424, avg=41218.33, stdev=16468.72
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[   25], 10.00th=[   25], 20.00th=[   25],
     | 30.00th=[   26], 40.00th=[   34], 50.00th=[   36], 60.00th=[   45],
     | 70.00th=[   54], 80.00th=[   58], 90.00th=[   62], 95.00th=[   65],
     | 99.00th=[   72], 99.50th=[  101], 99.90th=[  114], 99.95th=[  122],
     | 99.99th=[  125]
   bw (  MiB/s): min=   25, max= 2543, per=100.00%, avg=1509.31, stdev=597.77, samples=40
   iops        : min=   51, max= 5086, avg=3018.52, stdev=1195.56, samples=40
  lat (usec)   : 2=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.05%, 20=0.08%, 50=61.99%
  lat (msec)   : 100=37.32%, 250=0.52%
  cpu          : usr=7.33%, sys=68.46%, ctx=10055, majf=0, minf=48
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,61440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=1508MiB/s (1581MB/s), 1508MiB/s-1508MiB/s (1581MB/s-1581MB/s), io=30.0GiB (32.2GB), run=20374-20374msec