plotMachineIOPS_LATENCY/fio_output/write-16jobs-64files-512k.fio_ramdisk.out
jobs1: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=513671: Tue Jul 25 23:49:57 2023
  write: IOPS=6415, BW=3208MiB/s (3364MB/s)(30.0GiB/9577msec); 0 zone resets
    slat (usec): min=141, max=557, avg=154.96, stdev= 8.42
    clat (nsec): min=1866, max=31883k, avg=19758327.85, stdev=638494.61
     lat (usec): min=155, max=32072, avg=19913.42, stdev=641.15
    clat percentiles (usec):
     |  1.00th=[19530],  5.00th=[19530], 10.00th=[19792], 20.00th=[19792],
     | 30.00th=[19792], 40.00th=[19792], 50.00th=[19792], 60.00th=[19792],
     | 70.00th=[19792], 80.00th=[19792], 90.00th=[19792], 95.00th=[19792],
     | 99.00th=[21627], 99.50th=[21627], 99.90th=[21890], 99.95th=[28967],
     | 99.99th=[31589]
   bw (  MiB/s): min= 2953, max= 3223, per=99.89%, avg=3204.01, stdev=60.95, samples=19
   iops        : min= 5906, max= 6446, avg=6407.89, stdev=122.04, samples=19
  lat (usec)   : 2=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.06%, 20=97.52%, 50=2.37%
  cpu          : usr=9.48%, sys=90.51%, ctx=17, majf=0, minf=53
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,61440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=3208MiB/s (3364MB/s), 3208MiB/s-3208MiB/s (3364MB/s-3364MB/s), io=30.0GiB (32.2GB), run=9577-9577msec