plotMachineIOPS_LATENCY/fio_output/write-1jobs-1024files-32k.fio_tmpfs.out
jobs1: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO files (1024 files / total 30720MiB)
fio: pid=1167460, err=24/file:filesetup.c:805, func=open(/home/sevag/tmpfs//f1018), error=Too many open files

jobs1: (groupid=0, jobs=1): err=24 (file:filesetup.c:805, func=open(/home/sevag/tmpfs//f1018), error=Too many open files): pid=1167460: Wed Jul 26 09:23:47 2023
  write: IOPS=48.5k, BW=1516MiB/s (1590MB/s)(31.8MiB/21msec); 0 zone resets
    slat (nsec): min=8509, max=35235, avg=13030.89, stdev=2502.31
    clat (usec): min=39, max=3171, avg=2380.53, stdev=659.06
     lat (usec): min=50, max=3187, avg=2393.75, stdev=661.15
    clat percentiles (usec):
     |  1.00th=[  269],  5.00th=[  816], 10.00th=[ 1532], 20.00th=[ 2114],
     | 30.00th=[ 2376], 40.00th=[ 2376], 50.00th=[ 2409], 60.00th=[ 2409],
     | 70.00th=[ 2606], 80.00th=[ 3097], 90.00th=[ 3130], 95.00th=[ 3163],
     | 99.00th=[ 3163], 99.50th=[ 3163], 99.90th=[ 3163], 99.95th=[ 3163],
     | 99.99th=[ 3163]
  lat (usec)   : 50=0.10%, 250=0.79%, 500=1.77%, 750=1.77%, 1000=1.77%
  lat (msec)   : 2=11.87%, 4=81.94%
  cpu          : usr=5.00%, sys=90.00%, ctx=0, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=0.8%, 16=1.6%, 32=3.1%, >=64=93.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,1019,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=1516MiB/s (1590MB/s), 1516MiB/s-1516MiB/s (1590MB/s-1590MB/s), io=31.8MiB (33.4MB), run=21-21msec