plotMachineIOPS_LATENCY/fio_output/write-1jobs-1024files-512k.fio_tmpfs.out
jobs1: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO files (1024 files / total 30720MiB)
fio: pid=1191501, err=24/file:filesetup.c:805, func=open(/home/sevag/tmpfs//f1018), error=Too many open files

jobs1: (groupid=0, jobs=1): err=24 (file:filesetup.c:805, func=open(/home/sevag/tmpfs//f1018), error=Too many open files): pid=1191501: Wed Jul 26 10:35:04 2023
  write: IOPS=6329, BW=3165MiB/s (3318MB/s)(510MiB/161msec); 0 zone resets
    slat (usec): min=134, max=180, avg=151.81, stdev= 6.51
    clat (usec): min=45, max=20178, avg=18695.15, stdev=3844.47
     lat (usec): min=226, max=20332, avg=18847.12, stdev=3844.65
    clat percentiles (usec):
     |  1.00th=[ 1795],  5.00th=[ 8029], 10.00th=[15926], 20.00th=[19792],
     | 30.00th=[19792], 40.00th=[19792], 50.00th=[20055], 60.00th=[20055],
     | 70.00th=[20055], 80.00th=[20055], 90.00th=[20055], 95.00th=[20055],
     | 99.00th=[20055], 99.50th=[20055], 99.90th=[20055], 99.95th=[20055],
     | 99.99th=[20055]
  lat (usec)   : 50=0.10%, 500=0.10%, 750=0.20%, 1000=0.20%
  lat (msec)   : 2=0.59%, 4=1.28%, 10=3.73%, 20=73.01%, 50=20.80%
  cpu          : usr=0.00%, sys=99.38%, ctx=0, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=0.8%, 16=1.6%, 32=3.1%, >=64=93.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,1019,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=3165MiB/s (3318MB/s), 3165MiB/s-3165MiB/s (3318MB/s-3318MB/s), io=510MiB (534MB), run=161-161msec